arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_rtc_hal.h
#if FSL_DEVICE_HAS_WAKEUP_PIN
/*!
 * @brief Enable or disable the wakeup pin
 * @param base RTC base pointer
 * @param enable :
 *      - true to enable wakeup pin
 *      - false to disable it
 */
static inline void RTC_HAL_SetWakeupPinEnable(RTC_Type * const base,
                                                bool enable)
{
    uint32_t tmp = base->CR;
    tmp &= ~(RTC_CR_WPE_MASK);
    tmp |= RTC_CR_WPE(enable);
    base->CR = tmp;
}
/*!
 * @brief Get Wakeup pin enablement
 * @param base RTC base pointer
 * @return
 *      - false if Wakeup pin is disabled.
 *      - true if Wakeup pin is enabled (wakeup pin asserts if the RTC
 *        interrupt asserts or the wakeup pin is turned on).
 */
static inline bool RTC_HAL_GetWakeupPinEnable(RTC_Type * const base)
{
    uint32_t tmp = base->CR;
    tmp = (tmp & RTC_CR_WPE_MASK) >> RTC_CR_WPE_SHIFT;
    return (bool) (tmp);
}
#endif

/*!
 * @brief Trigger a software reset
 * @param base RTC base pointer
 */
static inline void RTC_HAL_SetSoftwareReset(RTC_Type * const base) {
    uint32_t tmp = base->CR;
    tmp &= ~(RTC_CR_SWR_MASK);
    tmp |= RTC_CR_SWR(1);
    base->CR = tmp;
}
/*!
 * @brief Clear Software reset flag
 * @param base RTC base pointer
 */
static inline void RTC_HAL_ClearSoftwareReset(RTC_Type * const base) {
    uint32_t tmp = base->CR;
    tmp &= ~(RTC_CR_SWR_MASK);
    base->CR = tmp;
}

/*****************************************************************************
 * Methods for RTC Status register
 ****************************************************************************/

/*!
 * @brief Enable or disable the Time counter
 *      When time counter is disabled the TSR register and TPR register are
 *      writable, but do not increment.
 *      When time counter is enabled the TSR register and TPR register are
 *      not writable, but increment.
 * @param base RTC base pointer
 * @param enable :
 *      - true to enable the counter
 *      - false to disable the counter
 */
static inline void RTC_HAL_SetTimeCounterEnable(RTC_Type * const base,
                                                          bool enable) {
    uint32_t tmp = base->SR;
    tmp &= ~(RTC_SR_TCE_MASK);
    tmp |= RTC_SR_TCE(enable);
    base->SR = tmp;
}
/*!
 * @brief Get the Time Counter Enable value
 * @param base RTC base pointer
 * @return :
 *      - true if the counter is enabled
 *      - false if the counter is disabled
 */
static inline bool RTC_HAL_GetTimeCounterEnable(RTC_Type * const base) {
    uint32_t tmp = base->SR;
    tmp = (tmp & RTC_SR_TCE_MASK) >> RTC_SR_TCE_SHIFT;
    return (bool) (tmp);
}

/*!
 * @brief Get the Time alarm flag
 *      - The alarm flag is cleared after a write in Time Alarm Register
 * @param base RTC base pointer
 * @return :
 *      - true if an alarm occurred
 *      - false if an alarm was not occurred
 */
static inline bool RTC_HAL_GetTimeAlarmFlag(RTC_Type * const base) {
    uint32_t tmp = base->SR;
    tmp = (tmp & RTC_SR_TAF_MASK) >> RTC_SR_TAF_SHIFT;
    return (bool) (tmp);
}

/*!
 * @brief Get Time Overflow Flag
 *      The TOF is set when Time Seconds Register overflows. Disable the
 *      counter and write TSR to clear this bit
 * @param base RTC base pointer
 * @return :
 *      - true if an overflow has occurred
 *      - false if an overflow has not occurred
 */
static inline bool RTC_HAL_GetTimeOverflowFlag(RTC_Type * const base) {
    uint32_t tmp = base->SR;
    tmp = (tmp & RTC_SR_TOF_MASK) >> RTC_SR_TOF_SHIFT;
    return (bool) (tmp);
}

/*!
 * @brief Get Time Invalid flag
 *      - The time invalid flag is set on POR or software reset. The TSR and
 *      TPR do not increment and read as zero when this bit is set. This bit
 *      is cleared by writing the TSR register when the time counter is
 *      disabled.
 * @param base RTC base pointer
 * @return :
 *      - true if TIF is set
 *      - false if TIF is clear
 */
static inline bool RTC_HAL_GetTimeInvalidFlag(RTC_Type * const base) {
    uint32_t tmp = base->SR;
    tmp = (tmp & RTC_SR_TIF_MASK) >> RTC_SR_TIF_SHIFT;
    return (bool) (tmp);
}

/*****************************************************************************
 * Methods for RTC Lock register
 ****************************************************************************/

/*!
 * @brief Lock the Lock Register
 *      This method locks the Lock Register. If the register is locked, it can
 *      be unlocked only with power-on reset(POR) or a software reset.
 * @param base RTC base pointer
 */
static inline void RTC_HAL_LockRegisterLock(RTC_Type * const base) {
    uint32_t tmp = base->LR;
    tmp &= ~(RTC_LR_LRL_MASK);
    base->LR = tmp;
}

/*!
 * @brief Get the Lock Register Lock state
 * @param base RTC base pointer
 * @return :
 *      -   true if register is locked
 *      -   false if the register is not locked
 */
static inline bool RTC_HAL_GetLockRegisterLock(RTC_Type * const base) {
    uint32_t tmp = base->LR;
    tmp = (tmp & RTC_LR_LRL_MASK) >> RTC_LR_LRL_SHIFT;
    return (bool) (!tmp);
}
/*!
 * @brief Lock the Status Register
 *      This method locks the Status Register. If the register is locked, it can
 *      be unlocked only with power-on reset(POR) or a software reset.
 * @param base RTC base pointer
 */
static inline void RTC_HAL_StatusRegisterLock(RTC_Type * const base) {
    uint32_t tmp = base->LR;
    tmp &= ~(RTC_LR_SRL_MASK);
    base->LR = tmp;
}
/*!
 * @brief Get the Status Register Lock state
 * @param base RTC base pointer
 * @return :
 *      -   true if register is locked
 *      -   false if the register is not locked
 */
static inline bool RTC_HAL_GetStatusRegisterLock(RTC_Type * const base) {
    uint32_t tmp = base->LR;
    tmp = (tmp & RTC_LR_SRL_MASK) >> RTC_LR_SRL_SHIFT;
    return (bool) (!tmp);
}
/*!
 * @brief Get the Control Register Lock state
 * @param base RTC base pointer
 * @return :
 *      -   true if register is locked
 *      -   false if the register is not locked
 */
static inline bool RTC_HAL_GetControlRegisterLock(RTC_Type * const base) {
    uint32_t tmp = base->LR;
    tmp = (tmp & RTC_LR_CRL_MASK) >> RTC_LR_CRL_SHIFT;
    return (bool) (!tmp);
}
/*!
 * @brief Lock the Control Register
 *      This method locks the Control Register. If the register is locked, 
 *      it can be unlocked only with power-on reset(POR).
 * @param base RTC base pointer
 */
static inline void RTC_HAL_ControlRegisterLock(RTC_Type * const base) {
    uint32_t tmp = base->LR;
    tmp &= ~(RTC_LR_CRL_MASK);
    base->LR = tmp;
}
/*!
 * @brief Get the TimeCompensation Register Lock state
 * @param base RTC base pointer
 * @return :
 *      -   true if register is locked
 *      -   false if the register is not locked
 */
static inline bool RTC_HAL_GetTimeCompensationLock(RTC_Type * const base) {
    uint32_t tmp = base->LR;
    tmp = (tmp & RTC_LR_TCL_MASK) >> RTC_LR_TCL_SHIFT;
    return (bool) (!tmp);
}
/*!
 * @brief Lock the TimeCompensation Register
 *      This method locks the TimeCompensation Register. If the register 
 *      is locked, it can be unlocked only with power-on reset(POR) or a 
 *      software reset.
 * @param base RTC base pointer
 */
static inline void RTC_HAL_TimeCompensationLock(RTC_Type * const base) {
    uint32_t tmp = base->LR;
    tmp &= ~(RTC_LR_TCL_MASK);
    base->LR = tmp;
}

/*****************************************************************************
 * Methods for RTC Interrupt Enable register
 ****************************************************************************/

/*!
 * @brief Configure Time Seconds interrupt
 * @param base RTC base pointer
 * @param intCfg Select at which frequency the interrupt
 *                 will occur.
 * @param type rtc_second_int_cfg_t
 */
static inline void RTC_HAL_SetTimeSecondsIntConf(RTC_Type * const base,
                                            rtc_second_int_cfg_t intCfg) {
    uint32_t tmp = base->IER;
    tmp &= ~(RTC_IER_TSIC_MASK);
    tmp |= RTC_IER_TSIC((uint8_t )intCfg);
    base->IER = tmp;
}
/*!
 * @brief Get Time Seconds interrupt config
 * @param base RTC base pointer
 * @return the Time Seconds interrupt configuration
 */
static inline rtc_second_int_cfg_t RTC_HAL_GetTimeSecondsIntConf(
                                                        RTC_Type * const base) {

    uint32_t tmp = base->IER;
    tmp = (tmp & RTC_IER_TSIC_MASK) >> RTC_IER_TSIC_SHIFT;
    return (rtc_second_int_cfg_t) (tmp);
}

#if FSL_DEVICE_HAS_WAKEUP_PIN
/*!
 * @brief Get Wakeup pin assertion
 * @param base RTC base pointer
 * @return :
 *      - true if the Wakeup pin is asserted
 */
static inline bool RTC_HAL_GetWakeupPinOn(RTC_Type * const base)
{
    uint32_t tmp = base->IER;
    tmp = (tmp & RTC_IER_WPON_MASK) >> RTC_IER_WPON_SHIFT;
    return (bool) (tmp);
}

/*!
 * @brief Software assert Wakeup pin, if the wakeup pin is enabled
 * @param base RTC base pointer
 * @param enable:
 *      - write true to assert the Wakeup pin
 * @param type bool
 */
static inline void RTC_HAL_SetWakeupPinOn(RTC_Type * const base, bool enable)
{
    uint32_t tmp = base->IER;
    tmp &= ~(RTC_IER_WPON_MASK);
    tmp |= RTC_IER_WPON((uint8_t)enable);
    base->IER = tmp;
}
#endif

/*!
 * @brief Enable TimeSeconds interrupt
 * @param base RTC base pointer
 * @param enable :
 *      - true to enable the interrupt
 *      - false to disable it
 * @param type bool
 */
static inline void RTC_HAL_SetTimeSecondsIntEnable(RTC_Type * const base,
                                                             bool enable) {
    uint32_t tmp = base->IER;
    tmp &= ~(RTC_IER_TSIE_MASK);
    tmp |= RTC_IER_TSIE(enable);
    base->IER = tmp;
}
/*!
 * @brief Get the TimeSeconds interrupt enable status
 * @param base RTC base pointer
 * @return The TimeSeconds interrupt enablement
 *      - true if interrupt is enabled
 *      - false if interrupt is disabled
 */
static inline bool RTC_HAL_GetTimeSecondsIntEnable(RTC_Type * const base) {
    uint32_t tmp = base->IER;
    tmp = (tmp & RTC_IER_TSIE_MASK) >> RTC_IER_TSIE_SHIFT;
    return (bool) (tmp);
}
/*!
 * @brief Enable TimeAlarm interrupt
 * @param base RTC base pointer
 * @param enable :
 *      - true to enable the interrupt
 *      - false to disable it
 * @param type bool
 */
static inline void RTC_HAL_SetTimeAlarmIntEnable(RTC_Type * const base,
                                                           bool enable) {
    uint32_t tmp = base->IER;
    tmp &= ~(RTC_IER_TAIE_MASK);
    tmp |= RTC_IER_TAIE(enable);
    base->IER = tmp;
}
/*!
 * @brief Get the TimeAlarm interrupt enable status
 * @param base RTC base pointer
 * @return The TimeAlarm interrupt enablement
 *      - true if interrupt is enabled
 *      - false if interrupt is disabled
 */
static inline bool RTC_HAL_GetTimeAlarmIntEnable(RTC_Type * const base) {
    uint32_t tmp = base->IER;
    tmp = (tmp & RTC_IER_TAIE_MASK) >> RTC_IER_TAIE_SHIFT;
    return (bool) (tmp);
}
/*!
 * @brief Enable TimeOverflow interrupt
 * @param base RTC base pointer
 * @param enable :
 *      - true to enable the interrupt
 *      - false to disable it
 * @param type bool
 */
static inline void RTC_HAL_SetTimeOverflowIntEnable(RTC_Type * const base,
                                                              bool enable) {
    uint32_t tmp = base->IER;
    tmp &= ~(RTC_IER_TOIE_MASK);
    tmp |= RTC_IER_TOIE(enable);
    base->IER = tmp;
}
/*!
 * @brief Get the TimeAlarm interrupt enable status
 * @param base RTC base pointer
 * @return The TimeOverflow interrupt enablement
 *      - true if interrupt is enabled
 *      - false if interrupt is disabled
 */
static inline bool RTC_HAL_GetTimeOverflowIntEnable(RTC_Type * const base) {
    uint32_t tmp = base->IER;
    tmp = (tmp & RTC_IER_TOIE_MASK) >> RTC_IER_TOIE_SHIFT;
    return (bool) (tmp);
}
/*!
 * @brief Enable TimeInvalid interrupt
 * @param base RTC base pointer
 * @param enable :
 *      - true to enable the interrupt
 *      - false to disable it
 * @param type bool
 */
static inline void RTC_HAL_SetTimeInvalidIntEnable(RTC_Type * const base,
                                                            bool enable) {
    uint32_t tmp = base->IER;
    tmp &= ~(RTC_IER_TIIE_MASK);
    tmp |= RTC_IER_TIIE(enable);
    base->IER = tmp;
}
/*!
 * @brief Get the TimeInvalid interrupt enable status
 * @param base RTC base pointer
 * @return The TimeInvalid interrupt enablement
 *      - true if interrupt is enabled
 *      - false if interrupt is disabled
 */
static inline bool RTC_HAL_GetTimeInvalidIntEnable(RTC_Type * const base) {
    uint32_t tmp = base->IER;
    tmp = (tmp & RTC_IER_TIIE_MASK) >> RTC_IER_TIIE_SHIFT;
    return (bool) (tmp);
}
/*! @}*/

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* __FSL_RTC_HAL_H__*/
/*******************************************************************************
 * EOF
 ******************************************************************************/
